app/controllers/chromosomes_controller.rb

SELECT "chromosomes".* FROM "chromosomes"
---
  def index
    @chromosomes = Chromosome.all