app/controllers/disorders_controller.rb

  def index

    if !params[:q]
      params[:q] = {:order => "descend_by_id"}
    end

    @search = Disorder.search(params[:q])
    @disorders = @search.result.page(params[:page]).per(20)
---
SELECT "disorders".* FROM "disorders" LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "disorders"