app/controllers/genes_controller.rb

  def index

    @search = Gene.search(params[:q])
    @genes = @search.result.page(params[:page]).per(20)
---
SELECT "genes".* FROM "genes"
SELECT "genes".* FROM "genes" LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "genes"