app/controllers/samples_controller.rb

SELECT "samples".* FROM "samples" ORDER BY "samples"."id" ASC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "samples"
---
  def index

    if !params[:q]
      params[:q] = {:order => "descend_by_id"}
    end

    @search = Sample.search(params[:q])
    @samples = @search.result.page(params[:page]).per(20)