app/controllers/uploads_controller.rb

SELECT "uploads".* FROM "uploads"
---
  def index
    @uploads = Upload.all

INSERT INTO "uploads" ("created_at", "updated_at", "upload_content_type", "upload_file_name", "upload_file_size", "upload_updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @upload = Upload.new(params[:upload])

    respond_to do |format|
      if @upload.save

SELECT "uploads".* FROM "uploads" WHERE "uploads"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def parse
    @upload = Upload.find(params[:id])