app/controllers/variants_controller.rb

SELECT "variants".* FROM "variants" LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "variants"
---
  def index
    if !params[:q]
      params[:q] = {:order => "descend_by_id"}
    end

    #pass the search params to a variable so it can be echoed in the search summary
   # @search_params = params[:q]
    #call the search scopes on the Variants
    @search = Variant.search(params[:q])
    @variants = @search.result.page(params[:page]).per(20)

SELECT "variants".* FROM "variants" WHERE "variants"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @variant = Variant.find(params[:id])

SELECT "variants".* FROM "variants" WHERE "variants"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @variant = Variant.find(params[:id])

SELECT "variants".* FROM "variants"
SELECT "locations".* FROM "locations" WHERE (position_start <= 113455427 AND position_end >= 113455427) LIMIT 1
---
  def batch_query_biomart
=begin
    variants = Variant.select(:all).pluck(:id)
    variant_array = variants.each_slice(20).to_a
    last_array = variant_array.last
    last_array_len = last_array.length
    i = 20 - last_array_len
    padding = Array.new(i)
    last_array.concat(padding)
    transpose_array = variant_array.transpose
=end
    location_array = Array.new
  	largest_array = 0
  	chromosomes = Chromosome.select(:all).pluck(:id)
  	chromosomes.each do |chromosome_id|

  		locations = Location.variants_by_chromosome(chromosome_id).pluck(:locatable_id)
  		locations.length > largest_array ? largest_array = locations.length : largest_array